#!usr/bin/python
#encoding:utf-8


'''会员中心弹层'''


__author__ = 'zhangbo'

from selenium import webdriver
from time import sleep
from selenium.webdriver.common.by import By


def user_center_layer_operation(driver):

#----------------------------------------------------------------------------------------------------------------------#

#----------------------------------------------------------------------------------------------------------------------#

    # 登录后：判断有无弹出层---------------
    try:

        #"请留意接听学习顾问电话哦"弹框--小学生、一年级人群
        driver.find_element_by_css_selector("body > div.add_c_consultant > div")
        sleep(2)

        #"请留意接听学习顾问电话哦"弹框关闭--小学生人群
        driver.find_element(By.CSS_SELECTOR,"body > div.add_c_consultant > div > a.add_course_close").click()

        sleep(2)

        print (u"请留意接听学习顾问电话哦弹框关闭！！！" + "\n")

    except:

        pass

#----------------------------------------------------------------------------------------------------------------------#

#----------------------------------------------------------------------------------------------------------------------#

    try:

        #"体系性的学习"弹框
        driver.find_element(By.XPATH,".//*[@id='m-intro']/div[5]/div/div[3]")
        sleep(2)

        #"体系性的学习"弹框关闭
        driver.find_element_by_xpath(".//*[@id='m-intro']/div[5]/div/a").click()
        sleep(2)

        # print (u"体系性的学习弹框关闭！！！" + "\n")

    except:

        pass

#----------------------------------------------------------------------------------------------------------------------#

#----------------------------------------------------------------------------------------------------------------------#

    try:
        #"绑定专属服务号，免费领绘本啦"弹框
        driver.find_element(By.CSS_SELECTOR,"body > div.sercice-dialog > div > a")
        sleep(2)

        #"绑定专属服务号，免费领绘本啦"弹框关闭
        driver.find_element_by_css_selector("body > div.sercice-dialog > div > a").click()
        sleep(2)

        # print (u"绑定专属服务号，免费领绘本啦弹框关闭！！！" + "\n")

    except:

        pass

#----------------------------------------------------------------------------------------------------------------------#
    #体验课约课页，已经体验过
#----------------------------------------------------------------------------------------------------------------------#

    #您当前已经没有免费体验机会，暂时无法预约体验课。请电话联系客服4000-515151进行人工预约。
    try:

        #知道了
        driver.find_element_by_xpath("//*[@id='indexSelsectTime']/div[3]/div/div[2]/a")
        sleep(2)

        #知道了关闭弹框
        driver.find_element_by_xpath("//*[@id='indexSelsectTime']/div[3]/div/div[2]/a").click()
        sleep(2)

        # print (u"体验课预约页，弹框关闭，返回会员中心！！！" + "\n")

    except:

        pass

#----------------------------------------------------------------------------------------------------------------------#
    #调研问卷
#----------------------------------------------------------------------------------------------------------------------#

    try:

        #"为了提供更好的服务，诚请您参与本期的调研，我们会认真对待每一条建议，感谢您的配合！"
        driver.find_element(By.XPATH,".//*[@id='j-investiga']/div/div/a")
        sleep(2)

        #"为了提供更好的服务，诚请您参与本期的调研，我们会认真对待每一条建议，感谢您的配合！"弹框关闭
        driver.find_element_by_xpath(".//*[@id='j-investiga']/div/div/a").click()
        sleep(2)

        # print (u"本期调查问卷关闭！！！" + "\n")

    except:

        pass

#----------------------------------------------------------------------------------------------------------------------#
    #个人信息面板
#----------------------------------------------------------------------------------------------------------------------#

    try:

        #个人信息面板关闭按钮
        driver.find_element(By.XPATH,".//*[@id='container']/div/div[5]/a[2]")
        sleep(2)


        driver.find_element_by_xpath(".//*[@id='container']/div/div[5]/a[2]").click()
        sleep(2)

        # print (u"个人信息面板关闭！！！" + "\n")

    except:

        pass

    sleep(2)